emacs-common/Emacs专业技巧.org
#+TITLE: Emacs专业技巧
#+URL: https://ambrevar.xyz/emacs/index.html
#+AUTHOR: lujun9972
#+TAGS: emacs-common
#+DATE: [2018年 10月 23日 星期二 10:12:34 HKT]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t n:nil ::t |:t ^:nil -:nil f:t *:t <:nil


Emacs是一只需要一段时间才能驯服的野兽。阅读官方文档，学习Elisp，寻找最好的第三方包，并向其他用户学习。

下面是设置Emacs的一些最佳小实践，以及我最喜欢的Emacs特性。请参阅我的[[https://gitlab.com/ambrevar/dotfiles][dotfiles]]以获得完整的配置。

另请参阅 [[https://ambrevar.xyz/emacs2/index.html][后续文章]]。

** Emacs 客户端和 Emacs 服务器（守护程序）
:PROPERTIES:
:CUSTOM_ID: org629126e
:END:

随着时间的推移，配置与之增长，Emacs可能需要花费一段时间来加载，特别是使用了大量包的时候。

运行守护进程将使Emacs只加载一次启动文件。这允许我们立即打开Emacs实例，同时还可以在各实例之间共享状态。

启动守护进程(如果还没有启动)和实例的最简单方法是将您的编辑器设置为这个脚本:

#+begin_src shell
  emacsclient -c -a "" "$@"
#+end_src

这里 =-a ""= 选项让 Emacs 在没有启动守护进程的时候启动守护进程。该命令会生成一个新的Emacs frame并立即返回，这通常符合我们的要求。

然而，这也有一些缺点。虽然在后台fork Emacs通常是一个好主意，但有时需要等待编辑完成(填写git提交消息或web浏览器字段时)，有时则应该fork后立即返回。
我们可以创建脚本链接，并根据脚本名称对等待行为进行参数化。这就有了下面的脚本: =em= fork后不直接返回，而 =emw= 和 =emc= 链接(分别是窗口版和控制台版)fork后直接返回调用者。

#+begin_src shell
  if [ "${0##*/}" = "emc" ]; then
      ## Force terminal mode
      param="-t"
  else
      ## If Emacs cannot start in graphical mode, -c will act just like -t.
      param="-c"
      if [ "${0##*/}" != "emw" ] && [ -n "$DISPLAY" ] && [ "$(emacs --batch -Q --eval='(message (if (fboundp '"'"'tool-bar-mode) "X" "TTY"))' 2>&1)" = X ]; then
          ## Don't wait if not called with "emw" and if Emacs can start in graphical mode.
          ## The Emacs batch test checks whether it was compiled with GUI suppport.
          param="$param -n"
      fi
  fi

  emacsclient "$param" -a "" "$@"
#+end_src

窗口版本的Emacs不受任何终端限制;而控制台版本的优势在于当在控制台中运行时不会生成新窗口。

然后，您可以根据自己的喜好设置环境，例如export ~EDITOR=em~ 和 ~VISUAL=emw~: 有些程序使用 =VISUAL= 变量并等待它返回，而另一些程序使用 =EDITOR= 变量并且不需要等待。这只是一个惯例，有些应用程序需要因地制宜的修改。

For instance, say you want to use =--no-site-file= to enforce a vanilla setting on invasive distributions, you can write the following wrapper:
如果希望向Emacs传递额外的参数，请创建一个 =Emacs= 的封装，并将其放在 =PATH= 的开头位置。
例如，假设您想要使用 =--no-site-file= 来强制让激进的发行版使用普通的设置，你可以编写以下包装:

#+begin_src shell
  #!/bin/sh
  exec /usr/bin/emacs --no-site-file "$@"
#+end_src

这对守护进程和独立实例的情况都适合。

** 初始化文件的架构
:PROPERTIES:
:CUSTOM_ID: orgac72560
:END:

启动非守护进程的Emacs实例时(例如，出于开发目的)将加载时间减少到最低也是明智的。

构建Emacs初始化文件的方法并不唯一，但是肯定有一些好的实践。我的个人设计原则是:

- 最小化Emacs启动时间。
- 保持简单。
- 不使用配置框架。

有些人喜欢依赖第三方包来为他们处理配置。我认为它增加了一层复杂性(以及不可避免的bug)，降低了灵活性。

为了最小化启动时间，我们需要根据运行模式来延迟加载配置。不属于全局配置的所有内容都可以根据条件进行加载。

*** Major-modes 配置
:PROPERTIES:
:CUSTOM_ID: orge771a4c
:END:

每个major模式相关的配置都可以移动到自己的配置文件中，在符合下面条件时进行加载:

- 当需要用到时再加载, 借助 =with-eval-after-load=,
- 以及只加载 /一次/,借助 =require= 函数.

In practice, it boils down to a simple line in =init.el=, e.g. for the C mode:
实际上，它可以归结为 =init.el= 中简单的一句话，例如对于C mode:

#+begin_src emacs-lisp
  (with-eval-after-load 'cc-mode (require 'init-cc))
#+end_src

第一次创建C缓冲区时, =c-mode= 这一autoload函数调用 =require= 加载 =cc-mode.el= 文件。
当文件加载后, =with-eval-after-load= 开始工作,调用 =require= 加载我们附加的 =init-cc=.
每次加载C缓冲区时，都要对 =with-eval-after-load= 语句进行求值，因此使用 =require= 而不是 =load= 很重要，这样我们只需加载配置一次即可。

=init-cc.el= 文件应该只包含c相关的全局配置:变量，函数定义，框架，等等。

#+begin_src emacs-lisp
  (setq semanticdb-default-save-directory (concat emacs-cache-folder "semanticdb"))
  (semantic-mode 1)
  (local-set-key (kbd "<f6>") (recompile))
  ;; …

  ;; Need to end with `provide' so that `require' does not load the file twice.
  (provide 'init-cc)
#+end_src

注意, =local-set-key= 通常用于全局性地设置模式快捷键，而 /不是/ 局限在缓冲区中的。
如果快捷键设置局限在缓冲区中，则意味着该模式没有使用标准模式API，或者没有调用 =use-local-map=. 你应该向上游报告这个问题。

你的某些配置可能需要局限在缓冲区自身，在这种情况下，您必须将其添加到模式钩子中。混乱的钩子会减慢缓冲区的创建速度，并可能带来混乱，因此建议只保留必要钩子的操作。

#+begin_src emacs-lisp
  (defun go-setup ()
    (setq indent-tabs-mode t)
    (set (make-local-variable 'compile-command) (concat "go run " (shell-quote-argument buffer-file-name)))
    (add-hook 'before-save-hook #'gofmt-before-save nil t))
  (add-hook 'go-mode-hook #'go-setup)
#+end_src

最后一个例子展示了钩子的三种作用:

- 设置一个缓冲区局部变量。(那些文档显示“Automatically becomes buffer-local when set.”的变量，比如 =indent-tab -mode=)。如果没有把这句添加到挂钩上，那么更改将只应用于当前缓冲区。可以使用 =make-variable-buffer-local= 命令将全局变量永久地设置为缓冲区局部变量。
- 仅为本mode设置一个变量为缓冲区局部本地，并设置其值. =compile-command= 在默认情况下是全局的:在mode钩子中将其设置为缓冲区局部变量，这样就允许在该mode下为各种缓冲区设置不同的编译命令，而其他模式将继续使用全局编译命令。
- 借助 =add-hook= 函数的 =LOCAL= 参数，对钩子做一个缓冲区局部的更改。对该钩子的更改将应用于此模式下的所有缓冲区，而对其他模式保持不变。

最后，不要在钩子中使用匿名函数:它使文档和意图更难理解，而且如果你需要不断修改钩子的话，还会使 =remove-hook= 函数的使用变得更加复杂。

