blog/2018/10/23/emacs专业技巧/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Emacs专业技巧 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="emacs-common" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document.git">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Emacs专业技巧</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org629126e">Emacs 客户端和 Emacs 服务器（守护程序）</a></li>
<li><a href="#orgac72560">初始化文件的架构</a>
<ul>
<li><a href="#orge771a4c">Major-modes 配置</a></li>
<li><a href="#org045ab4c">包管理</a></li>
</ul>
</li>
<li><a href="#org777b16a">Helm</a></li>
<li><a href="#org4e15ba0">更新到最新的Emacs版本</a></li>
<li><a href="#org661635e">缓存文件夹</a></li>
<li><a href="#org0a3e227">简化缩进</a></li>
<li><a href="#orgdd00133">Elisp中 “跳转到定义”</a></li>
<li><a href="#orgd3983ca">智能编译</a></li>
<li><a href="#org67905c0">C 的易读格式</a></li>
<li><a href="#orgcaa21f2">Magit</a></li>
<li><a href="#orgb468b2e">Multiple cursors</a></li>
<li><a href="#org7966e81">Org Mode</a></li>
<li><a href="#org48f03b1">引用</a></li>
</ul>
</div>
</div>
<p>
Emacs是一只需要一段时间才能驯服的野兽。阅读官方文档，学习Elisp，寻找最好的第三方包，并向其他用户学习。
</p>

<p>
下面是设置Emacs的一些最佳小实践，以及我最喜欢的Emacs特性。请参阅我的<a href="https://gitlab.com/ambrevar/dotfiles">dotfiles</a>以获得完整的配置。
</p>

<p>
另请参阅 <a href="https://ambrevar.xyz/emacs2/index.html">后续文章</a>。
</p>

<div id="outline-container-org28345f6" class="outline-2">
<h2 id="org629126e"><a id="org28345f6"></a>Emacs 客户端和 Emacs 服务器（守护程序）</h2>
<div class="outline-text-2" id="text-org629126e">
<p>
随着时间的推移，配置与之增长，Emacs可能需要花费一段时间来加载，特别是使用了大量包的时候。
</p>

<p>
运行守护进程将使Emacs只加载一次启动文件。这允许我们立即打开Emacs实例，同时还可以在各实例之间共享状态。
</p>

<p>
启动守护进程(如果还没有启动)和实例的最简单方法是将您的编辑器设置为这个脚本:
</p>

<div class="org-src-container">
<pre class="src src-shell">emacsclient -c -a <span style="font-style: italic;">""</span> <span style="font-style: italic;">"$@"</span>
</pre>
</div>

<p>
这里 <code>-a ""</code> 选项让 Emacs 在没有启动守护进程的时候启动守护进程。该命令会生成一个新的Emacs frame并立即返回，这通常符合我们的要求。
</p>

<p>
然而，这也有一些缺点。虽然在后台fork Emacs通常是一个好主意，但有时需要等待编辑完成(填写git提交消息或web浏览器字段时)，有时则应该fork后立即返回。
我们可以创建脚本链接，并根据脚本名称对等待行为进行参数化。这就有了下面的脚本: <code>em</code> fork后不直接返回，而 <code>emw</code> 和 <code>emc</code> 链接(分别是窗口版和控制台版)fork后直接返回调用者。
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"${0##*/}"</span> = <span style="font-style: italic;">"emc"</span> ]; <span style="font-weight: bold;">then</span>
    <span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Force terminal mode</span>
    <span style="font-weight: bold; font-style: italic;">param</span>=<span style="font-style: italic;">"-t"</span>
<span style="font-weight: bold;">else</span>
    <span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">If Emacs cannot start in graphical mode, -c will act just like -t.</span>
    <span style="font-weight: bold; font-style: italic;">param</span>=<span style="font-style: italic;">"-c"</span>
    <span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"${0##*/}"</span> != <span style="font-style: italic;">"emw"</span> ] &amp;&amp; [ -n <span style="font-style: italic;">"$DISPLAY"</span> ] &amp;&amp; [ <span style="font-style: italic;">"$(</span><span style="font-weight: bold;">emacs</span><span style="font-style: italic;"> --batch -Q --eval='(message (if (fboundp '"'"'tool-bar-mode) "X" "TTY"))' 2&gt;&amp;1)"</span> = X ]; <span style="font-weight: bold;">then</span>
        <span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">Don't wait if not called with "emw" and if Emacs can start in graphical mode.</span>
        <span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">The Emacs batch test checks whether it was compiled with GUI suppport.</span>
        <span style="font-weight: bold; font-style: italic;">param</span>=<span style="font-style: italic;">"$param -n"</span>
    <span style="font-weight: bold;">fi</span>
<span style="font-weight: bold;">fi</span>

emacsclient <span style="font-style: italic;">"$param"</span> -a <span style="font-style: italic;">""</span> <span style="font-style: italic;">"$@"</span>
</pre>
</div>

<p>
窗口版本的Emacs不受任何终端限制;而控制台版本的优势在于当在控制台中运行时不会生成新窗口。
</p>

<p>
然后，您可以根据自己的喜好设置环境，例如export <code>EDITOR=em</code> 和 <code>VISUAL=emw</code>: 有些程序使用 <code>VISUAL</code> 变量并等待它返回，而另一些程序使用 <code>EDITOR</code> 变量并且不需要等待。这只是一个惯例，有些应用程序需要因地制宜的修改。
</p>

<p>
For instance, say you want to use <code>--no-site-file</code> to enforce a vanilla setting on invasive distributions, you can write the following wrapper:
如果希望向Emacs传递额外的参数，请创建一个 <code>Emacs</code> 的封装，并将其放在 <code>PATH</code> 的开头位置。
例如，假设您想要使用 <code>--no-site-file</code> 来强制让激进的发行版使用普通的设置，你可以编写以下包装:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">sh</span>
<span style="font-weight: bold;">exec</span> /usr/bin/emacs --no-site-file <span style="font-style: italic;">"$@"</span>
</pre>
</div>

<p>
这对守护进程和独立实例的情况都适合。
</p>
</div>
</div>

<div id="outline-container-org78d497b" class="outline-2">
<h2 id="orgac72560"><a id="org78d497b"></a>初始化文件的架构</h2>
<div class="outline-text-2" id="text-orgac72560">
<p>
启动非守护进程的Emacs实例时(例如，出于开发目的)将加载时间减少到最低也是明智的。
</p>

<p>
构建Emacs初始化文件的方法并不唯一，但是肯定有一些好的实践。我的个人设计原则是:
</p>

<ul class="org-ul">
<li>最小化Emacs启动时间。</li>
<li>保持简单。</li>
<li>不使用配置框架。</li>
</ul>

<p>
有些人喜欢依赖第三方包来为他们处理配置。我认为它增加了一层复杂性(以及不可避免的bug)，降低了灵活性。
</p>

<p>
为了最小化启动时间，我们需要根据运行模式来延迟加载配置。不属于全局配置的所有内容都可以根据条件进行加载。
</p>
</div>

<div id="outline-container-org1ba57b5" class="outline-3">
<h3 id="orge771a4c"><a id="org1ba57b5"></a>Major-modes 配置</h3>
<div class="outline-text-3" id="text-orge771a4c">
<p>
每个major模式相关的配置都可以移动到自己的配置文件中，在符合下面条件时进行加载:
</p>

<ul class="org-ul">
<li>当需要用到时再加载, 借助 <code>with-eval-after-load</code>,</li>
<li>以及只加载 <i>一次</i>,借助 <code>require</code> 函数.</li>
</ul>

<p>
In practice, it boils down to a simple line in <code>init.el</code>, e.g. for the C mode:
实际上，它可以归结为 <code>init.el</code> 中简单的一句话，例如对于C mode:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">with-eval-after-load</span> 'cc-mode (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">init-cc</span>))
</pre>
</div>

<p>
第一次创建C缓冲区时, <code>c-mode</code> 这一autoload函数调用 <code>require</code> 加载 <code>cc-mode.el</code> 文件。
当文件加载后, <code>with-eval-after-load</code> 开始工作,调用 <code>require</code> 加载我们附加的 <code>init-cc</code>.
每次加载C缓冲区时，都要对 <code>with-eval-after-load</code> 语句进行求值，因此使用 <code>require</code> 而不是 <code>load</code> 很重要，这样我们只需加载配置一次即可。
</p>

<p>
<code>init-cc.el</code> 文件应该只包含c相关的全局配置:变量，函数定义，框架，等等。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> semanticdb-default-save-directory (concat emacs-cache-folder <span style="font-style: italic;">"semanticdb"</span>))
(semantic-mode 1)
(local-set-key (kbd <span style="font-style: italic;">"&lt;f6&gt;"</span>) (recompile))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8230;</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Need to end with `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">provide</span><span style="font-weight: bold; font-style: italic;">' so that `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">require</span><span style="font-weight: bold; font-style: italic;">' does not load the file twice.</span>
(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">init-cc</span>)
</pre>
</div>

<p>
注意, <code>local-set-key</code> 通常用于全局性地设置模式快捷键，而 <i>不是</i> 局限在缓冲区中的。
如果快捷键设置局限在缓冲区中，则意味着该模式没有使用标准模式API，或者没有调用 <code>use-local-map</code>. 你应该向上游报告这个问题。
</p>

<p>
你的某些配置可能需要局限在缓冲区自身，在这种情况下，您必须将其添加到模式钩子中。混乱的钩子会减慢缓冲区的创建速度，并可能带来混乱，因此建议只保留必要钩子的操作。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">go-setup</span> ()
  (<span style="font-weight: bold;">setq</span> indent-tabs-mode t)
  (set (make-local-variable 'compile-command) (concat <span style="font-style: italic;">"go run "</span> (shell-quote-argument buffer-file-name)))
  (add-hook 'before-save-hook #'gofmt-before-save nil t))
(add-hook 'go-mode-hook #'go-setup)
</pre>
</div>

<p>
最后一个例子展示了钩子的三种作用:
</p>

<ul class="org-ul">
<li>设置一个缓冲区局部变量。(那些文档显示“Automatically becomes buffer-local when set.”的变量，比如 <code>indent-tab -mode</code>)。如果没有把这句添加到挂钩上，那么更改将只应用于当前缓冲区。可以使用 <code>make-variable-buffer-local</code> 命令将全局变量永久地设置为缓冲区局部变量。</li>
<li>仅为本mode设置一个变量为缓冲区局部本地，并设置其值. <code>compile-command</code> 在默认情况下是全局的:在mode钩子中将其设置为缓冲区局部变量，这样就允许在该mode下为各种缓冲区设置不同的编译命令，而其他模式将继续使用全局编译命令。</li>
<li>借助 <code>add-hook</code> 函数的 <code>LOCAL</code> 参数，对钩子做一个缓冲区局部的更改。对该钩子的更改将应用于此模式下的所有缓冲区，而对其他模式保持不变。</li>
</ul>

<p>
最后，不要在钩子中使用匿名函数:它使文档和意图更难理解，而且如果你需要不断修改钩子的话，还会使 <code>remove-hook</code> 函数的使用变得更加复杂。
</p>
</div>
</div>
