emacs-common/Emacs专业技巧.org
*** 包管理
:PROPERTIES:
:CUSTOM_ID: org045ab4c
:END:

第三方包(无论是否major模式)可以根据其可用性以类似方式加载:如果包没有安装，就不需要解析其配置。过程都是一样的:

#+begin_src emacs-lisp
  (with-eval-after-load 'lua-mode (require 'init-lua))
#+end_src

如果你想让一个模式在启动时立即可用:

#+begin_src emacs-lisp
  (when (require 'helm-config nil t) (require 'init-helm))
#+end_src

** Helm
:PROPERTIES:
:CUSTOM_ID: org777b16a
:END:

[[https://emacs-helm.github.io/helm/][Helm]] 是一场用户界面革命:它为一切都加上了模糊搜索的功能!

它的理念是:以其列出可选项让你选择，不如在随着你的输入列出匹配项并不断缩小范围，同时根据最相关的结果有限排序。
此外，搜索可能是模糊匹配，这使它能在你不知道确切名字的时候找到实际的东西。

您可以查找缓冲区、命令、文档、文件等: 几乎所有需要 /查找/ 的内容。更细致的展示参见这篇 [[https://tuhdo.github.io/helm-intro.html][文章]]

helm的一个杀手级特性是在整个项目或文件树中搜索文本的能力。Helm自带了一些 /搜索器/: 除了grep本身，它也支持在当前版本控制仓库中grep(例如=git grep=)以及其他工具，例如 [[http://geoff.greer.fm/ag/][ag]] 和 [[https://github.com/monochromegane/the_platinum_searcher][pt]].

I have set the bindings to use the VCS grepper first and to fallback to =ag= when no file in the current folder is versioned:
VCS grep工具r通常比 =grep= 更快。我已经设置了快捷键有限使用VC grepper,在当前目录没有文件被纳入版本控制的情况下才退而求其次使用 =ag=:

#+begin_src emacs-lisp
  (defun call-process-to-string (program &rest args)
    "Call PROGRAM with ARGS and return output."
    (with-output-to-string
      (with-current-buffer
          standard-output
        (apply 'call-process program nil t nil args))))

  (defun helm-grep-git-or-ag (arg)
    "Run `helm-grep-do-git-grep' if possible; fallback to `helm-do-grep-ag' otherwise."
    (interactive "P")
    (require 'vc)
    (if (and (vc-find-root default-directory ".git")
             (or arg (split-string (call-process-to-string "git" "ls-files" "-z") "0" t)))
        (helm-grep-do-git-grep arg)
      (helm-do-grep-ag arg)))

  (global-set-key (kbd "C-x G") #'helm-grep-git-or-ag)
#+end_src

Helm的其他特点包括:

- 通过 =helm-semantic-or-imenu= 在当前buffer中查找全局变量和函数，或通过 =helm-imenu-in-all-buffers= 在所有缓冲区中查找全局变量和函数。
- 将set =helm-findutil-search-full-path= 设置为非nil可以在递归查找文件时启用适当的模糊查找(=helm-find=)，。
- 使用第三方的 =helm-ls-git= 在Git项目中查找文件。

- 调用 =yank= 查找最后一个区域。
- 使用universal参数扩展你的查询范围(例如，子文件夹)。

- 使用 =C-c C-f= 来激活follow模式，并在结果中导航以显示完整的上下文。
- 用 =C-x C-s= 保存helm会话，以便重用。使用 =wgrep= 编辑 =grep= buffer 并同时应用所有更改。
- 或使用 =C-x C-b= 恢复上一个helm会话。
- 我喜欢使用 =helm-occur= 替换 =M-s o=， 使用 =helm-all-mark-rings= 替换 =C-x C-x=， 使用 =helm-show-kill-ring= 替换 =M-y= ，等等。
- 使用=helm-company= 查询补全建议。
- Browse Man page sections with =helm-imenu=.
- 使用=helm-imenu= 浏览man页各章节。

** 更新到最新的Emacs版本
:PROPERTIES:
:CUSTOM_ID: org4e15ba0
:END:

您可能非常喜欢Emacs，希望它无处不在。然而，有时你却不得不使用一个过时的、蹩脚的系统，在这个系统上你没有管理特权。

我不建议坚持使用过时的版本:太多的基本特性和包依赖于最新的Emacs。

幸运的是，由于其高度的可移植性，编译最新的Emacs非常容易，并且可以安装在用户的HOME文件夹中。

** 缓存文件夹
:PROPERTIES:
:CUSTOM_ID: org661635e
:END:

(又名如何保持你的配置文件夹整洁。)

许多模式将缓存文件存储在 =~/.emacs.d= 中。我倾向于将这些临时文件保存在 =~/.cache/emacs= 中。

#+begin_src emacs-lisp
  (setq user-emacs-directory "~/.cache/emacs/")
  (if (not (file-directory-p user-cache-directory))
      (make-directory user-cache-directory t))

  ;; Some files need to be forced to the cache folder.
  (setq geiser-repl-history-filename (expand-file-name "geiser_history" user-emacs-directory))
  (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory))

  ;; Place backup files in specific directory.
  (setq backup-directory-alist
        `(("." . ,(expand-file-name "backups" user-emacs-directory))))
#+end_src

如果使用Semantic，请确保它是在更改缓存文件夹 /之后/ 启动的，因为它的数据库存储在那里。

** 简化缩进
:PROPERTIES:
:CUSTOM_ID: org0a3e227
:END:

我认为Emacs有太多的缩进选项。由于我强烈 [[https://ambrevar.xyz/indentation/index.html][支持总是使用TAB进行缩进]](除了Lisp),我使用 =defvaralias= 将各个模式的缩进级别重定向到一个名为 =tab-width= 的变量。

#+begin_src emacs-lisp
  (defvaralias 'standard-indent 'tab-width)
  (setq-default indent-tabs-mode t)

  ;; Lisp should not use tabs.
  (mapcar
   (lambda (hook)
     (add-hook
      hook
      (lambda () (setq indent-tabs-mode nil))))
   '(lisp-mode-hook emacs-lisp-mode-hook))

  ;; This needs to be set globally since they are defined as local variables and
  ;; Emacs does not know how to set an alias on a local variable.
  (defvaralias 'c-basic-offset 'tab-width)
  (defvaralias 'sh-basic-offset 'tab-width)
#+end_src

添加以下内容到 =sh-mode-hook=:

#+begin_src emacs-lisp
  (defvaralias 'sh-indentation 'sh-basic-offset)

#+end_src

由于历史原因，/C/ 和 /sh/ 的情况很特殊。其他模态的修正可以通过以下配置进行修正:

#+begin_src emacs-lisp
  (defvaralias 'js-indent-level 'tab-width)
  (defvaralias 'lua-indent-level 'tab-width)
  (defvaralias 'perl-indent-level 'tab-width)
#+end_src

** Elisp中 “跳转到定义”
:PROPERTIES:
:CUSTOM_ID: orgdd00133
:END:

Elisp有 =find-variable-at-point= 和 =find-function-at-point= 函数，但却没有一个合适的 =跳转到定义的= 命令。我们很快就能写出这个命令:

#+begin_src emacs-lisp
  (defun find-symbol-at-point ()
    "Find the symbol at point, i.e. go to definition."
    (interactive)
    (let ((sym (symbol-at-point)))
      (if (boundp sym)
          (find-variable sym)
        (find-function sym))))

  (define-key lisp-mode-shared-map (kbd "M-.") 'find-symbol-at-point)
#+end_src

