blog/2018/10/23/emacs专业技巧/index.html

<div id="outline-container-orgda744a8" class="outline-3">
<h3 id="org045ab4c"><a id="orgda744a8"></a>包管理</h3>
<div class="outline-text-3" id="text-org045ab4c">
<p>
第三方包(无论是否major模式)可以根据其可用性以类似方式加载:如果包没有安装，就不需要解析其配置。过程都是一样的:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">with-eval-after-load</span> 'lua-mode (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">init-lua</span>))
</pre>
</div>

<p>
如果你想让一个模式在启动时立即可用:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">helm-config</span> nil t) (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">init-helm</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2be33e6" class="outline-2">
<h2 id="org777b16a"><a id="org2be33e6"></a>Helm</h2>
<div class="outline-text-2" id="text-org777b16a">
<p>
<a href="https://emacs-helm.github.io/helm/">Helm</a> 是一场用户界面革命:它为一切都加上了模糊搜索的功能!
</p>

<p>
它的理念是:以其列出可选项让你选择，不如在随着你的输入列出匹配项并不断缩小范围，同时根据最相关的结果有限排序。
此外，搜索可能是模糊匹配，这使它能在你不知道确切名字的时候找到实际的东西。
</p>

<p>
您可以查找缓冲区、命令、文档、文件等: 几乎所有需要 <i>查找</i> 的内容。更细致的展示参见这篇 <a href="https://tuhdo.github.io/helm-intro.html">文章</a>
</p>

<p>
helm的一个杀手级特性是在整个项目或文件树中搜索文本的能力。Helm自带了一些 <i>搜索器</i>: 除了grep本身，它也支持在当前版本控制仓库中grep(例如=git grep=)以及其他工具，例如 <a href="http://geoff.greer.fm/ag/">ag</a> 和 <a href="https://github.com/monochromegane/the_platinum_searcher">pt</a>.
</p>

<p>
I have set the bindings to use the VCS grepper first and to fallback to <code>ag</code> when no file in the current folder is versioned:
VCS grep工具r通常比 <code>grep</code> 更快。我已经设置了快捷键有限使用VC grepper,在当前目录没有文件被纳入版本控制的情况下才退而求其次使用 <code>ag</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">call-process-to-string</span> (program <span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> args)
  <span style="font-style: italic;">"Call PROGRAM with ARGS and return output."</span>
  (<span style="font-weight: bold;">with-output-to-string</span>
    (<span style="font-weight: bold;">with-current-buffer</span>
        standard-output
      (apply 'call-process program nil t nil args))))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">helm-grep-git-or-ag</span> (arg)
  <span style="font-style: italic;">"Run `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">helm-grep-do-git-grep</span><span style="font-style: italic;">' if possible; fallback to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">helm-do-grep-ag</span><span style="font-style: italic;">' otherwise."</span>
  (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"P"</span>)
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">vc</span>)
  (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">and</span> (vc-find-root default-directory <span style="font-style: italic;">".git"</span>)
           (<span style="font-weight: bold;">or</span> arg (split-string (call-process-to-string <span style="font-style: italic;">"git"</span> <span style="font-style: italic;">"ls-files"</span> <span style="font-style: italic;">"-z"</span>) <span style="font-style: italic;">"0"</span> t)))
      (helm-grep-do-git-grep arg)
    (helm-do-grep-ag arg)))

(global-set-key (kbd <span style="font-style: italic;">"C-x G"</span>) #'helm-grep-git-or-ag)
</pre>
</div>

<p>
Helm的其他特点包括:
</p>

<ul class="org-ul">
<li>通过 <code>helm-semantic-or-imenu</code> 在当前buffer中查找全局变量和函数，或通过 <code>helm-imenu-in-all-buffers</code> 在所有缓冲区中查找全局变量和函数。</li>
<li>将set <code>helm-findutil-search-full-path</code> 设置为非nil可以在递归查找文件时启用适当的模糊查找(<code>helm-find</code>)，。</li>
<li>使用第三方的 <code>helm-ls-git</code> 在Git项目中查找文件。</li>

<li>调用 <code>yank</code> 查找最后一个区域。</li>
<li>使用universal参数扩展你的查询范围(例如，子文件夹)。</li>

<li>使用 <code>C-c C-f</code> 来激活follow模式，并在结果中导航以显示完整的上下文。</li>
<li>用 <code>C-x C-s</code> 保存helm会话，以便重用。使用 <code>wgrep</code> 编辑 <code>grep</code> buffer 并同时应用所有更改。</li>
<li>或使用 <code>C-x C-b</code> 恢复上一个helm会话。</li>
<li>我喜欢使用 <code>helm-occur</code> 替换 <code>M-s o=， 使用 =helm-all-mark-rings</code> 替换 <code>C-x C-x=， 使用 =helm-show-kill-ring</code> 替换 <code>M-y</code> ，等等。</li>
<li>使用=helm-company= 查询补全建议。</li>
<li>Browse Man page sections with <code>helm-imenu</code>.</li>
<li>使用=helm-imenu= 浏览man页各章节。</li>
</ul>
</div>
</div>

<div id="outline-container-orgd2c8782" class="outline-2">
<h2 id="org4e15ba0"><a id="orgd2c8782"></a>更新到最新的Emacs版本</h2>
<div class="outline-text-2" id="text-org4e15ba0">
<p>
您可能非常喜欢Emacs，希望它无处不在。然而，有时你却不得不使用一个过时的、蹩脚的系统，在这个系统上你没有管理特权。
</p>

<p>
我不建议坚持使用过时的版本:太多的基本特性和包依赖于最新的Emacs。
</p>

<p>
幸运的是，由于其高度的可移植性，编译最新的Emacs非常容易，并且可以安装在用户的HOME文件夹中。
</p>
</div>
</div>

<div id="outline-container-org1002236" class="outline-2">
<h2 id="org661635e"><a id="org1002236"></a>缓存文件夹</h2>
<div class="outline-text-2" id="text-org661635e">
<p>
(又名如何保持你的配置文件夹整洁。)
</p>

<p>
许多模式将缓存文件存储在 <code>~/.emacs.d</code> 中。我倾向于将这些临时文件保存在 <code>~/.cache/emacs</code> 中。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> user-emacs-directory <span style="font-style: italic;">"~/.cache/emacs/"</span>)
(<span style="font-weight: bold;">if</span> (not (file-directory-p user-cache-directory))
    (make-directory user-cache-directory t))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Some files need to be forced to the cache folder.</span>
(<span style="font-weight: bold;">setq</span> geiser-repl-history-filename (expand-file-name <span style="font-style: italic;">"geiser_history"</span> user-emacs-directory))
(<span style="font-weight: bold;">setq</span> elfeed-db-directory (expand-file-name <span style="font-style: italic;">"elfeed"</span> user-emacs-directory))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Place backup files in specific directory.</span>
(<span style="font-weight: bold;">setq</span> backup-directory-alist
      `((<span style="font-style: italic;">"."</span> . ,(expand-file-name <span style="font-style: italic;">"backups"</span> user-emacs-directory))))
</pre>
</div>

<p>
如果使用Semantic，请确保它是在更改缓存文件夹 <i>之后</i> 启动的，因为它的数据库存储在那里。
</p>
</div>
</div>

<div id="outline-container-org61ff1ee" class="outline-2">
<h2 id="org0a3e227"><a id="org61ff1ee"></a>简化缩进</h2>
<div class="outline-text-2" id="text-org0a3e227">
<p>
我认为Emacs有太多的缩进选项。由于我强烈 <a href="https://ambrevar.xyz/indentation/index.html">支持总是使用TAB进行缩进</a>(除了Lisp),我使用 <code>defvaralias</code> 将各个模式的缩进级别重定向到一个名为 <code>tab-width</code> 的变量。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">standard-indent</span> 'tab-width)
(<span style="font-weight: bold;">setq-default</span> indent-tabs-mode t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Lisp should not use tabs.</span>
(mapcar
 (<span style="font-weight: bold;">lambda</span> (hook)
   (add-hook
    hook
    (<span style="font-weight: bold;">lambda</span> () (<span style="font-weight: bold;">setq</span> indent-tabs-mode nil))))
 '(lisp-mode-hook emacs-lisp-mode-hook))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This needs to be set globally since they are defined as local variables and</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Emacs does not know how to set an alias on a local variable.</span>
(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">c-basic-offset</span> 'tab-width)
(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">sh-basic-offset</span> 'tab-width)
</pre>
</div>

<p>
添加以下内容到 <code>sh-mode-hook</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">sh-indentation</span> 'sh-basic-offset)

</pre>
</div>

<p>
由于历史原因，/C/ 和 <i>sh</i> 的情况很特殊。其他模态的修正可以通过以下配置进行修正:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">js-indent-level</span> 'tab-width)
(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">lua-indent-level</span> 'tab-width)
(<span style="font-weight: bold;">defvaralias</span> '<span style="font-weight: bold; font-style: italic;">perl-indent-level</span> 'tab-width)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea33cb0" class="outline-2">
<h2 id="orgdd00133"><a id="orgea33cb0"></a>Elisp中 “跳转到定义”</h2>
<div class="outline-text-2" id="text-orgdd00133">
<p>
Elisp有 <code>find-variable-at-point</code> 和 <code>find-function-at-point</code> 函数，但却没有一个合适的 <code>跳转到定义的</code> 命令。我们很快就能写出这个命令:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">find-symbol-at-point</span> ()
  <span style="font-style: italic;">"Find the symbol at point, i.e. go to definition."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let</span> ((sym (symbol-at-point)))
    (<span style="font-weight: bold;">if</span> (boundp sym)
        (find-variable sym)
      (find-function sym))))

(define-key lisp-mode-shared-map (kbd <span style="font-style: italic;">"M-."</span>) 'find-symbol-at-point)
</pre>
</div>
</div>
</div>
