emacs-common/Emacs专业技巧.org
** 智能编译
:PROPERTIES:
:CUSTOM_ID: orgd3983ca
:END:

Emacs有一种编译模式，可以非常方便地在缓冲区上运行任意命令，并根据错误信息导航回源代码。

它不仅对编译器有用，而且对浏览自己程序的调试消息、linter等也有用。

Emacs的标准行为是将最后使用的编译命令存储在全局变量 =compile-command= 中。
类似地, =compile-history= 会记住全局使用的所有编译命令。
如果你总在不同缓冲区之间进行切换，但想在不用切换会特定缓冲区就能在项目中运行相同的编译命令，那么这是非常有用的。

另一种方法是使 =compile-command= 变成缓冲区局部变量。你必须在特定的缓冲区中才能运行所需的命令。
实际上，我发现自己经常需要为项目运行几个与缓冲区相关的命令(编写文档、linting、构建库、构建可执行文件等)。

要使用缓冲区局部方法，请将下面内容添加到你初始化文件中，放在模式配置之前:

#+begin_src emacs-lisp
  (eval-after-load 'compile (make-variable-buffer-local 'compile-command))
#+end_src

我们可以根据要求对每个缓冲区设置各自的compile命令。如果你使用 =desktop= 模式保存会话，那么每个缓冲区的命令也可以恢复:

#+begin_src emacs-lisp
  (add-to-list 'desktop-locals-to-save 'compile-command)
#+end_src

Emacs提供了两个编译命令:

- =(compile COMMAND &optional COMINT)= 当以交互方式调用该命令时会提示输入运行命令。可以通过 =(call-interactively 'compile)= 来运行用户自定义命令。若要临时运行命令，则可以将 =compile-command= 的作用于局限在函数内。
- =(recompile &optional EDIT-COMMAND)= 可以方便地在不提示用户的情况下调用上一条命令。当使用 =compile-command= 作用域为buffer时，这种方法有一些缺陷。

  - =compile-history= 会保持不变，除非我们手工登记.
  - 该命令使用全局的 =compilation-directory=, 因此若在另一buffer上调用 =recompile=,而该buffer的目标文件又处于另一个目录，那么改命令可能会失败.我们也可以将 =compliation-directory= 变量作用域局限在buffer中，但这只有在从未使用 =compile= 的情况下才会起作用。这时, =compile-history= 尚未被使用。

简而言之:当 =compile-command= 作用于局限于buffer时，我们最好坚持使用 =compile= 而将 =recompile= 放在一边。

为了方便，我们添加一些快捷键:

#+begin_src emacs-lisp
  (defun compile-last-command () (interactive) (compile compile-command))
  (global-set-key (kbd "C-<f6>") #'compile)
  (global-set-key (kbd "<f6>") #'compile-last-command)
#+end_src

The linker flags are configurable on a per-buffer basis thanks to the buffer-local =cc-ldlibs= and =cc-ldflags= variables.
下面是一个关于C的完整示例:它将在父文件夹中查找最近的 =Makefile=,并将命令设置为 =make -C /path/to/ Makefile=, 或者根据语言(C或c++)和环境(GCC、Clang等)动态生成预设值。
由于 =cc-ldlibs= 和 =cc-ldflags= 是buffer局部变量,因此每个buffer都能有自己的链接器标志。

#+begin_src emacs-lisp
  (defvar-local cc-ldlibs "-lm -pthread"
    "Custom linker flags for C/C++ linkage.")

  (defvar-local cc-ldflags ""
    "Custom linker libs for C/C++ linkage.")

  (defun cc-set-compiler (&optional nomakefile)
    "Set compile command to be nearest Makefile or a generic command.
  The Makefile is looked up in parent folders. If no Makefile is
  found (or if NOMAKEFILE is non-nil or if function was called with
  universal argument), then a configurable commandline is
  provided."
    (interactive "P")
    (hack-local-variables)
    ;; Alternatively, if a Makefile is found, we could change default directory
    ;; and leave the compile command to "make". Changing `default-directory'
    ;; could have side effects though.
    (let ((makefile-dir (locate-dominating-file "." "Makefile")))
      (if (and makefile-dir (not nomakefile))
          (setq compile-command (concat "make -k -C " (shell-quote-argument (file-name-directory makefile-dir))))
        (setq compile-command
              (let
                  ((c++-p (eq major-mode 'c++-mode))
                   (file (file-name-nondirectory buffer-file-name)))
                (format "%s %s -o '%s' %s %s %s"
                        (if c++-p
                            (or (getenv "CXX") "g++")
                          (or (getenv "CC") "gcc"))
                        (shell-quote-argument file)
                        (shell-quote-argument (file-name-sans-extension file))
                        (if c++-p
                            (or (getenv "CXXFLAGS") "-Wall -Wextra -Wshadow -DDEBUG=9 -g3 -O0")
                          (or (getenv "CFLAGS") "-ansi -pedantic -std=c11 -Wall -Wextra -Wshadow -DDEBUG=9 -g3 -O0"))
                        (or (getenv "LDFLAGS") cc-ldflags)
                        (or (getenv "LDLIBS") cc-ldlibs)))))))

  (defun cc-clean ()
    "Find Makefile and call the `clean' rule. If no Makefile is
  found, no action is taken. The previous `compile' command is
  restored."
    (interactive)
    (let (compile-command
          (makefile-dir (locate-dominating-file "." "Makefile")))
      (when makefile-dir
        (compile (format "make -k -C %s clean" (shell-quote-argument makefile-dir))))))

  (dolist (map (list c-mode-map c++-mode-map))
    (define-key map "<f5>" #'cc-clean))

  (dolist (hook '(c-mode-hook c++-mode-hook))
    (add-hook hook #'cc-set-compiler))
#+end_src

** C 的易读格式
:PROPERTIES:
:CUSTOM_ID: org67905c0
:END:

我使用 [[http://uncrustify.sourceforge.net/][uncrustify]] 自动格式化C代码。参见我的 [[https://ambrevar.xyz/indentation/index.html][缩进原理]].

通过下面命令，我可以在Emacs对C代码进行格式化:

#+begin_src emacs-lisp
  (defun cc-fmt ()
    "Run uncrustify(1) on current buffer or region."
    (interactive)
    (let ((formatbuf (get-buffer-create "*C format buffer*"))
          status start end)
      (if (use-region-p)
          (setq start (region-beginning) end (region-end))
        (setq start (point-min) end (point-max)))
      (setq status
            (call-process-region start end "uncrustify" nil formatbuf nil "-lc" "-q" "-c"
                                 (concat (getenv "HOME") "/.uncrustify.cfg")))
      (if (/= status 0)
          (error "error running uncrustify")
        (delete-region start end)
        (insert-buffer formatbuf)
        (kill-buffer formatbuf))))
#+end_src

将其添加到 =before-save-hook= 中可以一直自动格式化我的代码，但是在使用不同的格式化规则处理源代码时，实践起来很糟糕。

