blog/2018/10/23/emacs专业技巧/index.html

<div id="outline-container-org61e1c41" class="outline-2">
<h2 id="orgd3983ca"><a id="org61e1c41"></a>智能编译</h2>
<div class="outline-text-2" id="text-orgd3983ca">
<p>
Emacs有一种编译模式，可以非常方便地在缓冲区上运行任意命令，并根据错误信息导航回源代码。
</p>

<p>
它不仅对编译器有用，而且对浏览自己程序的调试消息、linter等也有用。
</p>

<p>
Emacs的标准行为是将最后使用的编译命令存储在全局变量 <code>compile-command</code> 中。
类似地, <code>compile-history</code> 会记住全局使用的所有编译命令。
如果你总在不同缓冲区之间进行切换，但想在不用切换会特定缓冲区就能在项目中运行相同的编译命令，那么这是非常有用的。
</p>

<p>
另一种方法是使 <code>compile-command</code> 变成缓冲区局部变量。你必须在特定的缓冲区中才能运行所需的命令。
实际上，我发现自己经常需要为项目运行几个与缓冲区相关的命令(编写文档、linting、构建库、构建可执行文件等)。
</p>

<p>
要使用缓冲区局部方法，请将下面内容添加到你初始化文件中，放在模式配置之前:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(eval-after-load 'compile (make-variable-buffer-local 'compile-command))
</pre>
</div>

<p>
我们可以根据要求对每个缓冲区设置各自的compile命令。如果你使用 <code>desktop</code> 模式保存会话，那么每个缓冲区的命令也可以恢复:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'desktop-locals-to-save 'compile-command)
</pre>
</div>

<p>
Emacs提供了两个编译命令:
</p>

<ul class="org-ul">
<li><code>(compile COMMAND &amp;optional COMINT)</code> 当以交互方式调用该命令时会提示输入运行命令。可以通过 <code>(call-interactively 'compile)</code> 来运行用户自定义命令。若要临时运行命令，则可以将 <code>compile-command</code> 的作用于局限在函数内。</li>
<li><code>(recompile &amp;optional EDIT-COMMAND)</code> 可以方便地在不提示用户的情况下调用上一条命令。当使用 <code>compile-command</code> 作用域为buffer时，这种方法有一些缺陷。

<ul class="org-ul">
<li><code>compile-history</code> 会保持不变，除非我们手工登记.</li>
<li>该命令使用全局的 <code>compilation-directory</code>, 因此若在另一buffer上调用 <code>recompile</code>,而该buffer的目标文件又处于另一个目录，那么改命令可能会失败.我们也可以将 <code>compliation-directory</code> 变量作用域局限在buffer中，但这只有在从未使用 <code>compile</code> 的情况下才会起作用。这时, <code>compile-history</code> 尚未被使用。</li>
</ul></li>
</ul>

<p>
简而言之:当 <code>compile-command</code> 作用于局限于buffer时，我们最好坚持使用 <code>compile</code> 而将 <code>recompile</code> 放在一边。
</p>

<p>
为了方便，我们添加一些快捷键:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">compile-last-command</span> () (<span style="font-weight: bold;">interactive</span>) (compile compile-command))
(global-set-key (kbd <span style="font-style: italic;">"C-&lt;f6&gt;"</span>) #'compile)
(global-set-key (kbd <span style="font-style: italic;">"&lt;f6&gt;"</span>) #'compile-last-command)
</pre>
</div>

<p>
The linker flags are configurable on a per-buffer basis thanks to the buffer-local <code>cc-ldlibs</code> and <code>cc-ldflags</code> variables.
下面是一个关于C的完整示例:它将在父文件夹中查找最近的 <code>Makefile</code>,并将命令设置为 <code>make -C /path/to/ Makefile</code>, 或者根据语言(C或c++)和环境(GCC、Clang等)动态生成预设值。
由于 <code>cc-ldlibs</code> 和 <code>cc-ldflags</code> 是buffer局部变量,因此每个buffer都能有自己的链接器标志。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defvar-local</span> <span style="font-weight: bold; font-style: italic;">cc-ldlibs</span> <span style="font-style: italic;">"-lm -pthread"</span>
  <span style="font-style: italic;">"Custom linker flags for C/C++ linkage."</span>)

(<span style="font-weight: bold;">defvar-local</span> <span style="font-weight: bold; font-style: italic;">cc-ldflags</span> <span style="font-style: italic;">""</span>
  <span style="font-style: italic;">"Custom linker libs for C/C++ linkage."</span>)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">cc-set-compiler</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> nomakefile)
  <span style="font-style: italic;">"Set compile command to be nearest Makefile or a generic command.</span>
<span style="font-style: italic;">The Makefile is looked up in parent folders. If no Makefile is</span>
<span style="font-style: italic;">found (or if NOMAKEFILE is non-nil or if function was called with</span>
<span style="font-style: italic;">universal argument), then a configurable commandline is</span>
<span style="font-style: italic;">provided."</span>
  (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"P"</span>)
  (hack-local-variables)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Alternatively, if a Makefile is found, we could change default directory</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">and leave the compile command to "make". Changing `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">default-directory</span><span style="font-weight: bold; font-style: italic;">'</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">could have side effects though.</span>
  (<span style="font-weight: bold;">let</span> ((makefile-dir (locate-dominating-file <span style="font-style: italic;">"."</span> <span style="font-style: italic;">"Makefile"</span>)))
    (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">and</span> makefile-dir (not nomakefile))
        (<span style="font-weight: bold;">setq</span> compile-command (concat <span style="font-style: italic;">"make -k -C "</span> (shell-quote-argument (file-name-directory makefile-dir))))
      (<span style="font-weight: bold;">setq</span> compile-command
            (<span style="font-weight: bold;">let</span>
                ((c++-p (eq major-mode 'c++-mode))
                 (file (file-name-nondirectory buffer-file-name)))
              (format <span style="font-style: italic;">"%s %s -o '%s' %s %s %s"</span>
                      (<span style="font-weight: bold;">if</span> c++-p
                          (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"CXX"</span>) <span style="font-style: italic;">"g++"</span>)
                        (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"CC"</span>) <span style="font-style: italic;">"gcc"</span>))
                      (shell-quote-argument file)
                      (shell-quote-argument (file-name-sans-extension file))
                      (<span style="font-weight: bold;">if</span> c++-p
                          (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"CXXFLAGS"</span>) <span style="font-style: italic;">"-Wall -Wextra -Wshadow -DDEBUG=9 -g3 -O0"</span>)
                        (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"CFLAGS"</span>) <span style="font-style: italic;">"-ansi -pedantic -std=c11 -Wall -Wextra -Wshadow -DDEBUG=9 -g3 -O0"</span>))
                      (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"LDFLAGS"</span>) cc-ldflags)
                      (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"LDLIBS"</span>) cc-ldlibs)))))))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">cc-clean</span> ()
  <span style="font-style: italic;">"Find Makefile and call the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">clean</span><span style="font-style: italic;">' rule. If no Makefile is</span>
<span style="font-style: italic;">found, no action is taken. The previous `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">compile</span><span style="font-style: italic;">' command is</span>
<span style="font-style: italic;">restored."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let</span> (compile-command
        (makefile-dir (locate-dominating-file <span style="font-style: italic;">"."</span> <span style="font-style: italic;">"Makefile"</span>)))
    (<span style="font-weight: bold;">when</span> makefile-dir
      (compile (format <span style="font-style: italic;">"make -k -C %s clean"</span> (shell-quote-argument makefile-dir))))))

(<span style="font-weight: bold;">dolist</span> (map (list c-mode-map c++-mode-map))
  (define-key map <span style="font-style: italic;">"&lt;f5&gt;"</span> #'cc-clean))

(<span style="font-weight: bold;">dolist</span> (hook '(c-mode-hook c++-mode-hook))
  (add-hook hook #'cc-set-compiler))
</pre>
</div>
</div>
</div>

<div id="outline-container-org102805e" class="outline-2">
<h2 id="org67905c0"><a id="org102805e"></a>C 的易读格式</h2>
<div class="outline-text-2" id="text-org67905c0">
<p>
我使用 <a href="http://uncrustify.sourceforge.net/">uncrustify</a> 自动格式化C代码。参见我的 <a href="https://ambrevar.xyz/indentation/index.html">缩进原理</a>.
</p>

<p>
通过下面命令，我可以在Emacs对C代码进行格式化:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">cc-fmt</span> ()
  <span style="font-style: italic;">"Run uncrustify(1) on current buffer or region."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let</span> ((formatbuf (get-buffer-create <span style="font-style: italic;">"*C format buffer*"</span>))
        status start end)
    (<span style="font-weight: bold;">if</span> (use-region-p)
        (<span style="font-weight: bold;">setq</span> start (region-beginning) end (region-end))
      (<span style="font-weight: bold;">setq</span> start (point-min) end (point-max)))
    (<span style="font-weight: bold;">setq</span> status
          (call-process-region start end <span style="font-style: italic;">"uncrustify"</span> nil formatbuf nil <span style="font-style: italic;">"-lc"</span> <span style="font-style: italic;">"-q"</span> <span style="font-style: italic;">"-c"</span>
                               (concat (getenv <span style="font-style: italic;">"HOME"</span>) <span style="font-style: italic;">"/.uncrustify.cfg"</span>)))
    (<span style="font-weight: bold;">if</span> (/= status 0)
        (<span style="font-weight: bold;">error</span> <span style="font-style: italic;">"error running uncrustify"</span>)
      (delete-region start end)
      (insert-buffer formatbuf)
      (kill-buffer formatbuf))))
</pre>
</div>

<p>
将其添加到 <code>before-save-hook</code> 中可以一直自动格式化我的代码，但是在使用不同的格式化规则处理源代码时，实践起来很糟糕。
</p>
</div>
</div>
