emacs-common/Emacs专业技巧.org
** Magit
:PROPERTIES:
:CUSTOM_ID: orgcaa21f2
:END:

[[https://magit.vc/][Magit]] 时Git管理的福音. 最显著的g功能是在分段提交代码时很容易选择要提交的块。这个简单的功能和其他功能将对您的工作流程产生巨大的变化。

** Multiple cursors
:PROPERTIES:
:CUSTOM_ID: orgb468b2e
:END:

这个[[http://emacsrocks.com/e13.html][视频]]简单介绍这个强大异常的编辑框架。

2016年9月后，multiple cursors不再支持搜索，因此我使用 =phi-search= 来为其添加支持。

#+begin_src emacs-lisp
  (when (require 'multiple-cursors nil t)
    (setq mc/list-file (concat emacs-cache-folder "mc-lists.el"))
    ;; Load the file at the new location.
    (load mc/list-file t)
    (global-unset-key (kbd "C-<down-mouse-1>"))
    (global-set-key (kbd "C-<mouse-1>") #'mc/add-cursor-on-click)
    (global-set-key (kbd "C-x M-r") #'mc/edit-lines)
    (global-set-key (kbd "C-x M-m") #'mc/mark-more-like-this-extended)
    (global-set-key (kbd "C-x M-l") #'mc/mark-all-like-this-dwim)
    ;; mc-compatible with search.
    (require 'phi-search nil t))
#+end_src

如果你是Evil的用户，则 =multiple-cursors= 会工作失常. 你需要使用专用的 =evil-mc=.

** Org Mode
:PROPERTIES:
:CUSTOM_ID: org7966e81
:END:

最后时著名的[[http://orgmode.org/][Org模式]]。它提供了一些令人印象深刻的功能，比如无缝的表操作(通过快捷键交换列等…)和公式计算。下面这段摘录自手册:

#+BEGIN_EXAMPLE
Finally, just to whet your appetite for what can be done with the
fantastic `calc.el' package, here is a table that computes the Taylor
series of degree `n' at location `x' for a couple of functions.

|---+-------------+---+-----+--------------------------------------|
|   | Func | n | x | Result |
|---+-------------+---+-----+--------------------------------------|
| # | exp(x) | 1 | x | 1 + x |
| # | exp(x) | 2 | x | 1 + x + x^2 / 2 |
| # | exp(x) | 3 | x | 1 + x + x^2 / 2 + x^3 / 6 |
| # | x^2+sqrt(x) | 2 | x=0 | x*(0.5 / 0) + x^2 (2 - 0.25 / 0) / 2 |
| # | x^2+sqrt(x) | 2 | x=1 | 2 + 2.5 x - 2.5 + 0.875 (x - 1)^2 |
| * | tan(x) | 3 | x | 0.0175 x + 1.77e-6 x^3 |
|---+-------------+---+-----+--------------------------------------|
#+TBLFM: $5=taylor($2,$4,$3);n3
#+END_EXAMPLE

注意最后一列是自动计算出来的的!可以使用Calc模式，Elisp，甚至外部程序，如R或PARI/GP进行公式计算。可能性是无限的。

最后，你可以将最终结果导出成LaTeX、HTML等格式。

** 引用
:PROPERTIES:
:CUSTOM_ID: org48f03b1
:END:

聚合维基:

- [[https://github.com/emacs-tw/awesome-emacs]]
- [[https://github.com/pierre-lecocq/emacs4developers]]

用户配置:

- [[https://github.com/wasamasa/dotemacs/]]
- [[https://writequit.org/org/]]
- [[http://doc.rix.si/cce/cce.html]]
- [[https://github.com/larstvei/dot-emacs/blob/master/init.org]]
- [[https://github.com/hlissner/.emacs.d]]
- [[https://github.com/howardabrams/dot-files]]
- [[https://github.com/purcell/emacs.d/]]
- [[http://pages.sachachua.com/.emacs.d/]]

博客和其他资源:

- [[http://planet.emacsen.org/]]
- [[https://www.reddit.com/r/emacs/]]
- [[https://emacs.stackexchange.com/]]
- [[http://emacslife.com/]] and [[http://sachachua.com/blog/]]
